Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Unless your application has very specific requirements and solely targets JavaScript, you should be using the relevant functions in the math, json, and times stdlib modules instead.
ja: アプリケーションで非常に明確な要件があり JavaScript をターゲットにする場合を除き、 stdlib モジュールではなく math, json, および times で該当する関数をお使いください。

source: Unlock pages starting from a1 for a1 bytes and allow them to be swapped.
ja: a1 バイトの a1 からページをアンロックすることでスワップの発生を許可します。

source: Unlocks all memory for the running process to allow swapping.
ja: 実行プロセスのメモリをすべてアンロックすることでスワップの発生を許可します。

source: Unmaps (frees) all memory from both dst_addr and src_addr.
ja: dst_addr から src_addr までのメモリをアンマップ (開放) します。

source: Unspecified address.
ja: 未指定のアドレス。

source: Unstable API.
ja: この API は不安定です。

source: Until then other coroutines are executed.
ja: 条件を満たすまで、ほかのコルーチンが実行されます。

source: Unused symbols in the code.
ja: 未使用のシンボルがコードにある。

source: Unwrittable file closed.
ja: 読み取り専用ファイルが閉じられた。

source: Updates the MD5Context with the input data of length len.
ja: input データの長さ len を用いて MD5Context を更新します。

source: Uploading a new file
ja: 新しいファイルのアップロード

source: Uploads file to dest on the remote FTP server.
ja: リモート FTP サーバーの dest へ file をアップロードします。

source: Usage
ja: 用法

source: Usage example:
ja: 使用例:

source: Usage of this function asynchronously is recommended to view the progress of the download.
ja: この関数のお勧めの使い方はダウンロードの進捗状況を非同期で確認することです。

source: Usage with custom object
ja: カスタムオブジェクトの用法

source: Usage:
ja: 用法:

source: Use newXmlTree proc for creating a new tree.
ja: 新しいツリーを作成するには newXmlTree プロシージャ を使います。

source: Use os.createDir() and similar.
ja: os.createDir() および関連関数をお使いください。

source: Use os.walkPattern() and similar.
ja: os.walkPattern() および関連関数をお使いください。

source: Use toXmlAttributes proc to create XmlAttributes.
ja: XmlAttributes を作成するには toXmlAttributes プロシージャ を使います。

source: Use --cpu:i386 or --cpu:amd64 to switch the CPU architecture.
ja: CPU アーキテクチャを切り替えるには --cpu:i386 または --cpu:amd64 を指定します。

source: Use getOsFileHandle instead.
ja: 代わりに getOsFileHandle をお使いください。

source: Use {e} for set's incl, {k: v} for table's []= and e for seq's add.
ja: {e} は set (集合) の incl で、 {k: v} は table (テーブル) の []= で、そして e は seq (シーケンス) の add で使います。

source: Use CamelCase, not underscored_identifiers.
ja: スネークケース (underscored_identifiers) ではなく、キャメルケース (CamelCase) をお使いください。

source: Use a space after a colon, but not before it.
ja: コロンの前ではなく、後にスペースをお使いください。

source: Use bundled setjmp implementation.
ja: バンドルした setjmp バックエンドを使います。

source: Use globals or pass them by ptr.
ja: グローバル変数 (globals)、または ptr (ポインタ) 渡しをお使いください。

source: Use native debugger (gdb)
ja: ネイティブ・デバッガ (gdb) を使用します

source: Use setjmp backend.
ja: setjmp バックエンドを使います。

source: Use the withDir() template if you want to perform a temporary change only.
ja: 一時的に変更したいときは withDir() テンプレートをお使いください。

source: Use the code system.addQuitProc(resetAttributes) to restore the defaults.
ja: デフォルトへ復旧するには system.addQuitProc(resetAttributes) のコードをお使いください。

source: Use the linenoise library for interactive mode (not needed on Windows).
ja: インタラクティブモードで linenoise ライブラリを使います (Windows では不要)。

source: Use this iterator only if you require ALL the rows.
ja: 全部の行で必要な場合に限り、このイテレータをお使いください。

source: Use ucontext backend.
ja: ucontext バックエンドを使います。

source: Used by os.nim but also generally useful for dealing with paths.
ja: os.nim で使われていますが、一般的なパスの処理でも有用です。

source: Used in email MIME format, use lineLen and newline.
ja: 電子メールの MIME 形式で使われます。引数は lineLen と newline を指定します。

source: Useful when creating a closure in a loop to capture some local loop variables by their current iteration values.
ja: 現在のイテレート値でローカルのループ変数を取り込むときにループでクロージャを作成するときに便利です。

source: User confirmation for every single replace operation can be requested.
ja: ユーザにファイルごとに置換処理を行うかどうかの確認も可能です。

source: Uses fn to mix the colors a and b.
ja: a と b のカラーを関数 fn で混色します。

source: Using statement
ja: Using ステートメント

source: Value that ``telldir()`` would return.
ja: ``telldir()`` の値が返されます。

source: Values can be modified Source Edit
ja: Values can be modified ソース 編集

source: Var parameters
ja: Var パラメータ

source: Var return type
ja: Var 返値型

source: Var section
ja: Var セクション

source: Var statement
ja: Var ステートメント

source: Varargs pragma
ja: Varargs プラグマ

source: Vars
ja: 変数

source: Verbosity levels
ja: 詳細表示レベル

source: Version:
ja: バージョン:

source: Virtual machine
ja: 仮想マシン

source: Void context
ja: Void コンテキスト

source: Volatile pragma
ja: Volatile プラグマ

source: Waits for every thread in t to finish.
ja: スレッド t がすべて終了するまで待機します。

source: Waits for the process to finish and returns p's error code.
ja: プロセスの終了まで待機した後に p のエラーコードを返します。

source: Waits for the thread t to finish.
ja: スレッド t が終了するまで待機します。

source: Warning: this proc uses the GC and so cannot be used to load the GC.
ja: 警告: このプロシージャはガベージコレクターを使用しているため、ガベージコレクターのロードには使えません。

source: What to install:
ja: インストールするもの:

source: When OpenSSL is dynamically linked, the wrapper provides partial forward and backward compatibility for OpenSSL versions above and below 1.1.0
ja: OpenSSL の動的リンク時は、 OpenSSL バージョン 1.1.0 以前・以降における部分的な上位・下位互換性がラッパーにあります。

source: When a request is made by a client the specified callback will be called.
ja: クライアントによるリクエスト時は指定されたコールバックが呼び出されます。

source: When expression
ja: When 式

source: When installing documentation, .idx files are not required
ja: ドキュメンテーションのインストール時、 .idx は不要です。

source: When nimvm statement
ja: When nimvm ステートメント

source: When some argument is Style, set[Style], ForegroundColor, BackgroundColor or TerminalCmd then it is not sent directly to f, but instead corresponding terminal style proc is called.
ja: 引数が Style, set[Style], ForegroundColor, BackgroundColor または TerminalCmd のとき、 f には直送されず、かわりにで対応するターミナルの style プロシージャが呼び出されます。

source: When statement
ja: When ステートメント

source: When the process has finished executing, cleanup related handles.
ja: プロセスの実行終了後に、関連するハンドルを抹消します。

source: When you iterate over objects with different field types you have to use the compile time when instead of a runtime if to select the code you want to run for each type.
ja: 異種フィールド型のオブジェクトをイテレートするとき、型ごとにコードを選択して実行したいのであれば、実行時ではなくコンパイル時に使わなくてはいけません。

source: While statement
ja: While ステートメント

source: Wildcards in filenames are supported.
ja: ワイルドカードによるファイル名もサポートしています。

source: Windows section
ja: Windows セクション

source: Windows specific
ja: Windows 専用

source: With Power Comes Responsibility
ja: 大いなる力には責任が伴う

source: Word wraps s.
ja: s にワードラップをします。

source: Wrapper for time_t.
ja: time_t のラッパーです。

source: Wrapper for the console object for the JavaScript backend.
ja: JavaScript バックエンドで使える console オブジェクトのラッパーです。

source: Wrappers
ja: ラッパー

source: Write a varint into z.
ja: varint へ z を書き込みます。

source: Writes data to the file specified asynchronously.
ja: 指定されたファイルに data を非同期で書き込みます。

source: Writes size bytes from buf to the file specified asynchronously.
ja: buf から size バイトを指定されたファイルへ非同期で書き込みます。

source: Writes a value to the file f.
ja: ファイル f に値を書き込みます。

source: Writes data to the specified future stream as the file is read.
ja: ファイルから読み取りを行い、指定された Future ストリームへデータを書き込みます。

source: Writes the given RST node as JSON that is in the form
ja: 指定された RST ノードを JSON 形式として出力します。

source: Writes the list of registered foreign deps to stdout.
ja: 登録された外部パッケージの依存性リストを標準出力に書き出します。

source: Writes the specified value inside the specified future stream.
ja: 指定の Future ストリームへ指定値を出力します。

source: Writes the string:
ja: 出力文字列:

source: Writes the text txt in a given style to stdout.
ja: 指定された style でテキスト txt を標準出力へ出力します。

source: Writtable file was closed.
ja: 書き込み可能ファイルが閉じられた。

source: XML Processing
ja: XML の処理

source: Yes it's --profiler:off.
ja: もちろん --profiler:off を指定します。

source: Yield statement
ja: Yield ステートメント

source: Yields (index, a[index]) pairs.
ja: (index, a[index]) ペアを生成します。

source: You can add Nim's bin directory to your $PATH or use the install command to place it where it will be found.
ja: Nim の bin ディレクトリのパスは環境変数 $PATH へ追加できます。また、 bin ディレクトリのパスを確認するには install コマンドを実行します。

source: You can add and modify these files to your project to change the look of docgen output.
ja: 前述のファイルをプロジェクトへ追加・修正すると docgen で出力したドキュメンテーションの表情を変更できます。

source: You can also use addEscaped proc.
ja: addEscaped プロシージャ も使えます。

source: You can also use ESTP as a memory profiler to see which stack traces allocate the most memory and thus create the most GC pressure.
ja: スタックトレースにおける大量のメモリ割り当て、およびそれに伴う大量の強制ガベージコレクタの発生を確認するために ESTP をメモリプロファイラとして使うこともできます。

source: You can do so with the connect procedure.
ja: 接続には connect プロシージャを使います。

source: You can import the packages/docutils/rstgen module in your programs if you want to reuse the compiler's documentation generation procs.
ja: コンパイラに搭載されているドキュメント生成ツールのプロシージャを再利用したいときは、プログラムで packages/docutils/rstgen モジュール をインポートします。

source: You can in fact look at nimprof's source code to see how to implement your own profiler.
ja: なお、自作のプロファイラを実装する方法を調べたいときは nimprof のソースコードを参考にしてください。

source: You can of course use GDB or Visual Studio to debug the compiler (via --debuginfo --lineDir:on).
ja: もちろん、 GDB または Visual Studio でコンパイラのデバッグができます (--debuginfo --lineDir:on による)。

source: You can pass options to the test command, they will be forwarded to the tester.
ja: test コマンドにオプションを指定すると、テスターへ転送します。

source: You can then find them on the website.
ja: ドキュメントはウェブサイトに掲載してあります。

source: You can use this command to test different options, the same you would issue for the boot command.
ja: このコマンドは boot コマンドに問題があると思われるときに、ビルドオプションのテストで使えます。

source: You can use this to build your own syntax highlighting, check this example:
ja: このモジュールで自作のシンタックスハイライトを構築できます。この用例をご確認ください。

source: You can wrap them with asynchronous procedures using promises and newPromise:
ja: promise と newPromise で非同期プロシージャを接続可能です。

source: You may use peek proc to avoid the blocking.
ja: ブロックを回避するには peek プロシージャをお使いください。

source: You need to close the process when done.
ja: プロセス終了時に close を必ず呼び出してください。

source: You only need to import this module to get a profiling report at program exit.Timer support for the realtime GC.
ja: プログラム終了後にプロファイリング・レポートを得るには、このモジュールをインポートしてください。 リアルタイム・ガベージコレクターはタイマーをサポートしています。

source: Zahary Karadjov
ja: ザハリー・カラジョフ

source: [Common] cc=gcc # '=' and ':' are the same --foo="bar" # '--cc' and 'cc' are the same, 'bar' and '"bar"' are the same (except for '#') macrosym: "#" # Note that '#' is interpreted as a comment without the quotation --verbose [Windows] isConsoleApplication=False ; another comment [Posix] isConsoleApplication=True key1: "in this string backslash escapes are interpreted\n" key2: r"in this string not" key3: """triple quotes strings are also supported.
ja: [Common] cc=gcc # '=' と ':' は同じ --foo="bar" # '--cc' と 'cc' は同じであり、 'bar' と '"bar"' は同じです ('#' を除く) macrosym: "#" # '#' はクォーテーションがなくてもコメントとして解釈されることに注意してください --verbose [Windows] isConsoleApplication=False ; 別のコメント記法 [Posix] isConsoleApplication=True key1: "この文字列のバックスラッシュはエスケープとして解釈されます\n" key2: r"この文字列はエスケープとして解釈されません" key3: """三連クォート文字列にも 対応しています。

source: [deprecated] Start types with a capital T, unless they are pointers/references which start with P.
ja: [廃止] 頭文字が P のポインタや参照である場合を除いて、型の頭文字は大文字の T にします。

source: a channel for thread communication Source Edit
ja: スレッド通信用チャンネルです ソース 編集

source: a compiled regular expression Source Edit
ja: a compiled regular expression ソース 編集

source: a handle that can be used to get a row's column text on demand Source Edit
ja: 要求された行にあるテキスト列を得るために使うハンドル ソース 編集

source: a handle that can be Source Edit
ja: 使用できるハンドル ソース 編集

source: a handle to a dynamically loaded library Source Edit
ja: 動的ロードライブラリのハンドルです ソース 編集

source: a identifier for the prepared queries Source Edit
ja: 準備済みクエリの識別子 ソース 編集

source: a rational number, consisting of a numerator and denominator Source Edit
ja: a rational number, consisting of a numerator and denominator ソース 編集

source: a row of a dataset.
ja: データセットの行。

source: a stream that encapsulates a MemFile Source Edit
ja: a stream that encapsulates a MemFile ソース 編集

source: a superset of datatypes that might be supported.
ja: サポートされているデータ型の上位型です。

source: a.dot(b) -> a.b Source Edit
ja: a.dot(b) -> a.b ソース 編集

source: absolutePath proc
ja: absolutePath プロシージャ

source: acyclic pragma
ja: acyclic プラグマ

source: add RunningRegress b to a Source Edit
ja: add RunningRegress b to a ソース 編集

source: add a file (either a C file, dll, an object, a library or an ld script).
ja: ファイルを追加します (C ファイル、DLL、オブジェクトまたはリンカ ld のスクリプトのいずれか)。

source: add a second RunningStats b to a Source Edit
ja: add a second RunningStats b to a ソース 編集

source: add a symbol to the compiled program Source Edit
ja: コンパイルしたプログラムへシンボルを追加します ソース 編集

source: add in system include path Source Edit
ja: システムのインクルードパスへ追加します ソース 編集

source: add include path Source Edit
ja: インクルードパスを設定します ソース 編集

source: add path to search paths
ja: 指定のパスを検索パスへ追加します

source: add proc
ja: add プロシージャ

source: addFileExt proc
ja: addFileExt プロシージャ

source: additional packages for the distribution
ja: ディストリビューションの追加パッケージ

source: alias analysis
ja: エイリアス分析

source: alias for contains.
ja: contains のエイリアスです。

source: also used for number of elements
ja: 要素数でも使います

source: am a child process Source Edit
ja: am a child process ソース 編集

source: an OID Source Edit
ja: オブジェクト ID (OID) です ソース 編集

source: an RST node Source Edit
ja: RST ノード ソース 編集

source: an RST node's description Source Edit
ja: RST ノードの内容 ソース 編集

source: an SQL abstract syntax tree node Source Edit
ja: SQL における抽象構文木 (AST) のノード ソース 編集

source: an SQL query string Source Edit
ja: SQL クエリ文字列 ソース 編集

source: an accumulator for regression calculations Source Edit
ja: an accumulator for regression calculations ソース 編集

source: an accumulator for statistical data Source Edit
ja: an accumulator for statistical data ソース 編集

source: an alias for 'send'.
ja: 'send' のエイリアスです。

source: an alias for renderSQL.
ja: renderSQL のエイリアスです。

source: apostrophe
ja: アポストロフィ

source: arguments are passed to the program being run (if --run option is selected)
ja: 引数はプログラムの実行時に渡されます (--run オプション選択時)

source: asmNoStackFrame pragma
ja: asmNoStackFrame プラグマ

source: asyncdispatch module
ja: asyncdispatch モジュール

source: attach a msg to current PFrame.
ja: 現在の PFrame へ msg を接続します。

source: attributes changed Source Edit
ja: attributes changed ソース 編集

source: available and required on windows.
ja: Windows で利用可能・必須です。

source: available on unix and alike (default)
ja: Unix およびクローンで利用可能です (デフォルト)

source: available on unix and alike (x86/64 only)
ja: Unix およびクローンで利用可能です (x86/64 専用)

source: avoids a function call (unlike getFrame()) Source Edit
ja: 関数の呼び出しを無効化します (getFrame() とは異なります) ソース 編集

source: backslash
ja: バックスラッシュ

source: backspace
ja: バックスペース

source: be case insensitive
ja: 英数大小文字を同一視します。

source: be style insensitive
ja: スタイルを同一視します。

source: be verbose: list every processed file
ja: 詳細表示: 処理済みファイルのリストを表示します。

source: bitwise OR of all supported exceptions Source Edit
ja: bitwise OR of all supported exceptions ソース 編集

source: boolean flag whether a deinstallation shell script should be generated.
ja: アンインストール用シェルスクリプト生成の有無を boolean フラグで指定します。

source: boolean flag whether an Inno Setup installer should be generated for Windows.
ja: Windows 版 Inno Setup インストーラ生成の有無を boolean フラグで指定します。

source: boolean flag whether an installation shell script should be generated.
ja: インストール用シェルスクリプト生成の有無を boolean フラグで指定します。

source: boot command
ja: boot コマンド

source: build an index for the whole documentation
ja: ドキュメンテーション全体の索引をビルドします

source: c, cpp codegen
ja: c, cpp コード生成

source: call this before starting to send your HTML data to stdout.
ja: これは HTML データを stdout へ送信する前に呼び出してください。

source: carriage return
ja: キャリッジリターン

source: changeFileExt proc
ja: changeFileExt プロシージャ

source: channels module
ja: channels モジュール

source: char
ja: 文字

source: check if a value is exactly null Source Edit
ja: check if a value is exactly null ソース 編集

source: check if a value is exactly undefined Source Edit
ja: check if a value is exactly undefined ソース 編集

source: checks the project for syntax and semantic
ja: プロジェクトのシンタックスとセマンティクスを確認します

source: closes the base lexer.
ja: lexer の基底オブジェクトを閉じます。

source: closes the database connection.
ja: データベースの接続を終了します。

source: closes the parser my and its associated input stream.
ja: パーサー my と関連する入力ストリームを閉じます

source: closure interators
ja: クロージャ―のイテレータ

source: col is preferred, inconsistent right now
ja: col が好ましいのですが、現時点では一貫性はありません

source: collections
ja: コレクション

source: commandLineParams proc
ja: commandLineParams プロシージャ

source: commands that can be expressed as arguments Source Edit
ja: 引数として表現可能なコマンド ソース 編集

source: compilation option pragmas
ja: コンパイルオプションのプラグマ

source: compile a string containing a C source.
ja: Ｃ ソースにある文字列をコンパイルします。

source: compile project to C++ code
ja: C++ コードのプロジェクトをコンパイルします

source: compile project to Javascript
ja: Javascript のプロジェクトをコンパイルします

source: compile project to Objective C code
ja: Objective C コードのプロジェクトをコンパイルします

source: compile project with C code generator
ja: プロジェクトを C コードジェネレータでコンパイルします

source: compile project with default code generator (C)
ja: プロジェクトをデフォルトのコードジェネレータ (C 言語) でコンパイルします

source: compile time error otherwise Source Edit
ja: それ以外の型はコンパイル時にエラーとなります ソース 編集

source: compile your program with the --profiler:off --stackTrace:on -d:memProfiler command line options.
ja: コマンドラインオプション --profiler:off --stackTrace:on -d:memProfiler でプログラムをコンパイルしてください。

source: compile your program with the --profiler:on --stackTrace:on command line options
ja: コマンドラインオプション --profiler:on --stackTrace:on でプログラムをコンパイルしてください。

source: compileTime pragma
ja: compileTime プラグマ

source: computedGoto pragma
ja: computedGoto プラグマ

source: computes the current correlation of the two data sets pushed into r Source Edit
ja: computes the current correlation of the two data sets pushed into r ソース 編集

source: computes the current intercept of r Source Edit
ja: computes the current intercept of r ソース 編集

source: computes the current mean of s Source Edit
ja: computes the current mean of s ソース 編集

source: computes the current population kurtosis of s Source Edit
ja: computes the current population kurtosis of s ソース 編集

source: computes the current population skewness of s Source Edit
ja: computes the current population skewness of s ソース 編集

source: computes the current population standard deviation of s Source Edit
ja: computes the current population standard deviation of s ソース 編集

source: computes the current population variance of s Source Edit
ja: computes the current population variance of s ソース 編集

source: computes the current sample kurtosis of s Source Edit
ja: computes the current sample kurtosis of s ソース 編集

source: computes the current sample skewness of s Source Edit
ja: computes the current sample skewness of s ソース 編集

source: computes the current sample standard deviation of s Source Edit
ja: computes the current sample standard deviation of s ソース 編集

source: computes the current sample variance of s Source Edit
ja: computes the current sample variance of s ソース 編集

source: computes the current slope of r Source Edit
ja: computes the current slope of r ソース 編集

source: computes the mean of x Source Edit
ja: computes the mean of x ソース 編集

source: computes the population kurtosis of x Source Edit
ja: computes the population kurtosis of x ソース 編集

source: computes the population skewness of x Source Edit
ja: computes the population skewness of x ソース 編集

source: computes the population standardDeviation of x Source Edit
ja: computes the population standardDeviation of x ソース 編集

source: computes the population variance of x Source Edit
ja: computes the population variance of x ソース 編集

source: computes the sample kurtosis of x Source Edit
ja: computes the sample kurtosis of x ソース 編集

source: computes the sample skewness of x Source Edit
ja: computes the sample skewness of x ソース 編集

source: computes the sample standardDeviation of x Source Edit
ja: computes the sample standardDeviation of x ソース 編集

source: computes the sample variance of x Source Edit
ja: computes the sample variance of x ソース 編集

source: configuration files for Nim
ja: Nim のコンフィギュレーション・ファイル

source: confirm each occurrence/replacement; there is a chance to abort any time without touching the file
ja: ファイルごとに検索結果と置換処理の確認を行います。ファイルを変更せずに処理をいつでも中止することができます。

source: consider overloading [] for get; consider to not use get as a prefix: len instead of getLen
ja: get は [] のオーバーロードであるとみなします。接頭語として get を使わないでください: getLen ではなく len をお使いください

source: consider overloading []= for put
ja: put は []= のオーバーロードであるとみなします

source: constructs a "captured search" for the PEG a Source Edit
ja: constructs a "captured search" for the PEG a ソース 編集

source: constructs a "greedy positive repetition" with the PEG a Source Edit
ja: constructs a "greedy positive repetition" with the PEG a ソース 編集

source: constructs a "greedy repetition" for the PEG a Source Edit
ja: constructs a "greedy repetition" for the PEG a ソース 編集

source: constructs a "not predicate" with the PEG a Source Edit
ja: constructs a "not predicate" with the PEG a ソース 編集

source: constructs a "search" for the PEG a Source Edit
ja: constructs a "search" for the PEG a ソース 編集

source: constructs a PEG from a character set s Source Edit
ja: constructs a PEG from a character set s ソース 編集

source: constructs a PEG from a terminal char Source Edit
ja: constructs a PEG from a terminal char ソース 編集

source: constructs a PEG from a terminal string Source Edit
ja: constructs a PEG from a terminal string ソース 編集

source: constructs a PEG from a terminal string; ignore case for matching Source Edit
ja: constructs a PEG from a terminal string; ignore case for matching ソース 編集

source: constructs a PEG from a terminal string; ignore style for matching Source Edit
ja: constructs a PEG from a terminal string; ignore style for matching ソース 編集

source: constructs a PEG that consists of the nonterminal symbol Source Edit
ja: constructs a PEG that consists of the nonterminal symbol ソース 編集

source: constructs a SqlQuery from the string query.
ja: 文字列 query から SqlQuery を作成 (constructs) します。

source: constructs a capture with the PEG a Source Edit
ja: constructs a capture with the PEG a ソース 編集

source: constructs a nonterminal symbol Source Edit
ja: constructs a nonterminal symbol ソース 編集

source: constructs a sequence with all the PEGs from a Source Edit
ja: constructs a sequence with all the PEGs from a ソース 編集

source: constructs an "and predicate" with the PEG a Source Edit
ja: constructs an "and predicate" with the PEG a ソース 編集

source: constructs an optional for the PEG a Source Edit
ja: constructs an optional for the PEG a ソース 編集

source: constructs an ordered choice with the PEGs in a Source Edit
ja: constructs an ordered choice with the PEGs in a ソース 編集

source: constructs the PEG any character (.) Source Edit
ja: constructs the PEG any character (.) ソース 編集

source: constructs the PEG any rune (_) Source Edit
ja: constructs the PEG any rune (_) ソース 編集

# constructs the PEG newline ( ) Source Edit
source: constructs the PEG newline (\n) Source Edit
ja: constructs the PEG newline (\n) ソース 編集

source: convert MultipartData to string so it's human readable when echo see https://github.com/nim-lang/Nim/issues/11863 Source Edit
ja: convert MultipartData to string so it's human readable when echo see https://github.com/nim-lang/Nim/issues/11863 ソース 編集

source: convert a reStructuredText file to HTML
ja: reStructuredText ファイルを HTML へ変換します

source: convert a reStructuredText file to TeX
ja: reStructuredText ファイルを TeX へ変換します

source: converts s to destEncoding that was given to the converter c.
ja: 指定されたコンバータ c で s を destEncoding へ変換します。

source: converts s to destEncoding.
ja: s を destEncoding へ変換します。

source: converts a PEG to its string representation Source Edit
ja: converts a PEG to its string representation ソース 編集
